import guidoImg from  "../../assets/guido.GuidovanRossum20625.web_.jpg";
export default function LearnHome() {
  return (
    <div className="page-content">
      <h1>รู้จัก Python</h1>
        <hr/>
        <h2>จุดเริ่มต้น ของภาษา Python</h2>
        <img src={guidoImg} alt="Guido van Rossum" width="450"/>
        <p>ภาษา Python ถูกสร้างขึ้นโดย Guido van Rossum (กีโด ฟาน รอสซัม)
            ในช่วงปลายปี 1989 ที่ประเทศเนเธอร์แลนด์  
            ตอนนั้น Guido ทำงานอยู่ที่ CWI (Centrum Wiskunde & Informatica) ซึ่งเป็นศูนย์วิจัยด้านคณิตศาสตร์และวิทยาการคอมพิวเตอร์
        </p>
        <h3>เขาต้องการภาษาโปรแกรมที่</h3>
        <p>- เขียนง่าย</p>
        <p>- อ่านง่าย</p>
        <p>- ทำงานได้จริงจังเหมือนภาษา C</p>
        <p>- แต่ใช้งานสะดวกเหมือนภาษา ABC (ภาษาที่เขาเคยมีส่วนร่วมพัฒนา)</p>
        <p>ดังนั้น Guido จึงเริ่มพัฒนา ภาษาใหม่ในเวลาว่างช่วงคริสต์มาสปี 1989</p>
        <hr/>
        <h2>ทำไมถึงชื่อ “Python” ?</h2>
        <p>ชื่อ “Python” ไม่ได้มาจากงูครับ 🐍
            แต่มาจากรายการตลกอังกฤษที่ชื่อว่า
            “Monty Python’s Flying Circus”
            ซึ่ง Guido ชื่นชอบมาก
        </p>
        <p>แต่ต่อมา “งู” ก็กลายเป็นสัญลักษณ์ของ Python ไปโดยปริยาย เพราะชื่อมันพ้องกันนั่นเอง</p>
        <hr/>
        <h2>เวอร์ชันแรก</h2>
        <h3> Python 0.9.0 ออกมาในปี 1991</h3>
        <p>
            ซึ่งมีฟีเจอร์สำคัญหลายอย่างที่ยังคงใช้มาจนถึงปัจจุบัน เช่น
        </p>
        <p>- ฟังก์ชัน (function)</p>
        <p>- Exception handling</p>
        <p>- โมดูล (module)</p>
        <p>- และโครงสร้างข้อมูลพื้นฐาน (list, dict, str, ฯลฯ)</p>
        <hr/>
         <h2>พัฒนาอย่างต่อเนื่อง</h2>
         <h3>Python 2.0 (ปี 2000)</h3>
         <p>เพิ่มระบบจัดการหน่วยความจำอัตโนมัติ (Garbage Collection) และการรองรับ Unicode</p>
         <h3>Python 3.0 (ปี 2008)</h3>
         <p>เป็นการ “รีดีไซน์ครั้งใหญ่” เพื่อแก้จุดอ่อนของ Python 2
            แต่เนื่องจากเปลี่ยนแปลงมาก ทำให้โปรแกรมเก่าจาก Python 2 ใช้กับ Python 3 ไม่ได้โดยตรง
        </p>
        <h3>ตั้งแต่ ปี 2020 เป็นต้นมา</h3>
        <p>Python 2 ถูกยุติการสนับสนุนอย่างเป็นทางการ
            ปัจจุบันทุกอย่างใช้ Python 3.x เป็นมาตรฐาน
        </p>
        <hr/>
        <h2>ทำไม Python ถึงได้รับความนิยม</h2>
        <h3>เพราะ Python มีจุดเด่นคือ</h3>
        <p>1.เขียนง่าย — โครงสร้างภาษาชัดเจน อ่านเหมือนภาษาอังกฤษ</p>
        <p>2.มีชุมชนขนาดใหญ่ และไลบรารีมากมาย</p>
        <p>3.ใช้ได้หลายด้าน เช่น</p>
        <p>- วิทยาการข้อมูล (Data Science)</p>
        <p>- ปัญญาประดิษฐ์ (AI / Machine Learning)</p>
        <p>- พัฒนาเว็บไซต์ (Web Development)</p>
        <p>- งานอัตโนมัติ (Automation)</p>
        <p>- เกม / IoT / การศึกษา</p>
        <hr/>
        <h2>ปัจจุบัน</h2>
        <p>ตอนนี้ Python ถือเป็นหนึ่งใน ภาษาที่ได้รับความนิยมมากที่สุดในโลก
            ติดอันดับต้น ๆ ของการจัดอันดับภาษาโปรแกรมจากหลายสถาบัน (เช่น TIOBE, Stack Overflow)
            และยังเป็นภาษาหลักในหลายวงการ เช่น AI, Data Science, Cybersecurity, และ Education สืบค้นเมื่อ 1/11/2568
        </p>
    </div>
  );
}
