
import "../components/Home.css";
export default function Home() {

  return (
  <div className="page-home">
    <h1>แจ้งเตือน !</h1>
    <hr/>
    <div className="btn-page-home">
      <h3>เว็บไซต์นี้สร้างขึ้นเพื่อการศึกษาภาษาโปรแกรม Python </h3>
      {"\n"} <h3>เเละเป็นส่วนหนึ่งของโครงงาน วิชาวิทยาการคอมพิวเตอร์</h3>
      <hr/>
      <p>
         1. ที่เลือกภาษานี้เพราะว่า Python เป็นภาษาที่เข้าใจง่าย เหมาะสำหรับผู้เริ่มต้น  สามารถนำไปต่อยอดได้หลากหลาย เเละ สังคมของ Python ใหญ่มาก สามารถเรียนรู้ได้จากหลายเเหล่ง
      </p>

      <p>
        2. Python มีโครงสร้างภาษาที่อ่านง่าย คล้ายกับภาษามนุษย์ ทำให้ผู้เรียนสามารถเข้าใจแนวคิดการเขียนโปรแกรมได้อย่างรวดเร็ว อีกทั้งยังมีชุมชนผู้ใช้งานขนาดใหญ่ทั่วโลก ที่คอยพัฒนาเครื่องมือ Library และ Framework ใหม่ ๆ ออกมาอย่างต่อเนื่อง
      </p>

      <p>
        3. นอกจากนี้ Python ยังสามารถทำงานร่วมกับภาษาอื่น ๆ ได้ดี เช่น C, C++, และ Java รวมถึงสามารถนำไปใช้ในงานด้าน Data Science, Machine Learning, Web Development, Game Development และอีกมากมาย
      </p>
      <hr/>
      <p>
        * เว็บไซต์นี้จึงถูกสร้างขึ้นเพื่อรวบรวมความรู้พื้นฐานการใช้งานเเละการเขียนโปรเเกรมเกี่ยวกับภาษา Python  หวังว่าเว็บไซต์นี้จะเป็นประโยชน์ต่อผู้ที่สนใจเรียนรู้การเขียนโปรแกรม 
        และเป็นแรงบันดาลใจให้ทุกคนได้เริ่มต้นสร้างสรรค์ผลงาน ด้วยภาษา Python 
        ไม่ว่าจะเป็นโปรเจกต์เล็ก ๆ หรือระบบขนาดใหญ่ในอนาคต
      </p>
      <p> 

      </p>
      <hr/>
      <h3>
        หากคุณเป็นผู้เริ่มต้น อย่ากังวล! Python ถูกออกแบบมาให้เรียนรู้ได้ง่าย 
        และเมื่อคุณเข้าใจพื้นฐานแล้ว คุณจะสามารถต่อยอดไปสู่เทคโนโลยีใหม่ ๆ ได้อย่างมั่นใจ
      </h3>
    </div>
  </div>
  );
}
